{
  "ukrainian": "LABYRINTH LEGENDS by @rntdev\n\nСпочатку, створіть Телеграм-бота за допомогою BotFather і запишіть токен в файлі .env (скопіюйте .env-example як .env) в папці \"game\". Доки ви читаєте, відкрийте ваш бот в телеграмі. Але не натискайте /start, а якщо вже натиснули, то напишіть /start вручну, коли гра почнеться.\n\nДобрий день! Це я - блокнот, але не звичайний, а розмовляючий! Почнімо. Колись, в давнину, коли ще блукали динозаври, і я був малим блокнотом, хтось створив захоплюючу гру. Дозвольте розповісти вам про неї. Гра була надзвичайно цікавою! В 2022 році я вирішив створити гру, яка транслюватиметься на YouTube і можна буде керувати нею через телеграм-бот. На жаль, я відмовився від цього проекту (я ніколи не закінчую свої персональні проєкти), але тепер, телепортувавшись в 2025 рік, я повернувся! Я переписав всю гру з нуля та додав десяток нових фіч. Короткий огляд функцій:\n1. Ви потрапляєте в лабіринт, де за вами полює Тінь. Вона може спати або рухатися з різною швидкістю. Щоб її вимкнути, в файлі .env змініть DEBUG на 0.\n2. В лабіринті можна збирати зірочки, які також можна витрачати у Трейдерів.\n3. Для переміщення використовуйте стрілочки у боті (або в крайньому випадку стрілочки на клавіатураі, якщо виникне потреба).\n4. Іноді в лабіринті може з'явитися динаміт, який завдає сильного ушкодження.\n5. Іноді в лабіринті з'являються торговці, які продають різні речі за зірочки та муви (муви - це валюта, що визначається кількістю разів як ви натиснули кнопку зі стрілочкою у боті).\n6. Предмети поділяються на 4 типи: Мечі, Артефакти, Зілля та Пети (іноді пети багаються). Мечі просто збільшують завдане вами ушкодження Тіні. Артефакти надають різні ефекти. Зілля просто дають який-небудь бустер або бонус. Пети слідкують за Тінню та б'ють її (теоретично).\n7. Щоб переглянути активні зілля, натисніть кнопку BACKPACK у боті.\n8. Ваш пет за замовчуванням - Камінь. Він не рухається.\n9. Моя сестра дуже боялася музики в грі, тому я створив артефакт, який змінює музику.\n10. Інший світ. Якщо ви вдастесь втекти з лабіринту, вас телепортує в інший світ, де кожна зірочка дорівнює трьом, і динаміт завдає подвійного ушкодження.\n11. Динаміт завдає ушкодження навіть Тіні.\n12. Пети можуть зупинятися на 3 секунди.\n13. Здоров'я Тіні відображається над нею. Якщо ви її поб'єте, вона відродиться і стане вдвічі потужнішою. Ваша мета - довести Тінь до 5 воскресінь.\n14. Тінь дуже міцна! Щоб атакувати її, натискайте кнопку Attack у боті. Без мечів ви завдаєте лише 1 пошкодження за ударом.\n\nДякую вам за увагу, тепер ви готові до битви! Мій GitHub - https://github.com/remotefulrntdev. Є питання? Звертайтеся до мене в Discord (@rntdev).",
  "english": "LABYRINTH LEGENDS by @rntdev\n\nFirst, create a Telegram bot using BotFather and put its token in the .env file (copy .env-example file as .env) in \"game\" folder. While you are reading, open your bot in Telegram. But don't press /start, and if you already pressed it, type it manually when the game starts.\n\nHello! I'm a notebook, but not an ordinary one, a talking one! Let's start. Once upon a time, when dinosaurs were still roaming the earth, I was a small notebook, and someone created an amazing game. Let me tell you about it. The game was incredibly interesting! In 2022, I decided to create a game that would be broadcasted on YouTube and can be controlled through a Telegram bot. Unfortunately, I dropped this project (I never finish my personal projects), but now, I have returned! I rewrote the entire game from scratch and added a dozen new features. Here is a brief overview of the features:\n1. You enter the labyrinth, where the Shadow is chasing you. It can sleep or move with different speeds. To disable it, change the DEBUG variable in the .env file to 0.\n2. In the labyrinth, you can collect stars, which can also be spent on Traders.\n3. To move, use the arrow buttons in the bot (or the arrow keys on your keyboard if you need to).\n4. Sometimes, a dynamite may appear in the labyrinth, which deals massive damage.\n5. Sometimes, traders appear in the labyrinth, selling various items for stars and moves (moves are a currency that is determined by the number of times you pressed the arrow button in the bot).\n6. Items are divided into four types: Swords, Artifacts, Potions, and Pets (sometimes pets may bug). Swords just increase the damage you deal to the Shadow. Artifacts give different effects. Potions just give some kind of boost or bonus. Pets follow the Shadow and hit her (theoretically).\n7. To view active potions, press the BACKPACK button in the bot.\n8. Your pet by default is a Stone. It doesn't move.\n9. My sister was very scared of the music in the game, so I created an artifact that changes the music.\n10. Another world. If you manage to escape the labyrinth, you will be teleported to another world, where each star is equal to three, and dynamite deals double damage.\n11. Dynamite deals damage to the Shadow too.\n12. Pets can stop moving for 3 seconds.\n13. The Shadow's health is displayed above her. If you kill it, it will be reborn and become twice as powerful. Your goal is to bring the Shadow to 5 revivals.\n14. The Shadow is very strong! To attack it, press the Attack button in the bot. Without swords, you will only deal 1 damage per hit.\n\nThank you for your attention, now you are ready for battle! My GitHub is https://github.com/remotefulrntdev. Do you have questions? Contact me in Discord (@rntdev)."
}