{
    "text": "LABYRINTH LEGENDS\n<ДЛЯ ЗАПУСКУ, ЗАПУСТІТЬ EMERGENCY.BAT>\nДоки ви читаєте, відкрийте @RetubeGamerBot в телеграмі. Але не натискайте /start, а якщо вже натиснули, то напишіть /start вручну, коли гра почнеться.\n\nДобрий день! Це я - блокнот, але не звичайний, а розмовляючий! Почнімо. Колись, в давнину, коли ще блукали динозаври, і я був малим блокнотом, хтось створив захоплюючу гру. Дозвольте розповісти вам про неї. Гра була надзвичайно цікавою! В 2022 році я вирішив створити гру, яка транслюватиметься на YouTube і можна буде керувати нею через телеграм-бот. На жаль, я відмовився від цього проекту, але тепер, телепортувавшись в 2024 рік, я повертаюсь! Поглянувши назад, я розумію, наскільки поганий код я тоді написав. Я витратив на цю гру понад 30 годин (ЗА ТИЖДЕНЬ), тому, якщо ви вирішите знизити оцінку, подумайте про те, як мені буде сумно. Короткий огляд функцій:\n1. Ви потрапляєте в лабіринт, де за вами полює Тінь. Вона може спати або рухатися з різною швидкістю. Щоб її вимкнути, в файлі .env змініть DEBUG на 0.\n2. В лабіринті можна збирати зірочки, які також можна втрачати.\n3. Для переміщення використовуйте кнопки у боті (або стрілочки, якщо виникне потреба).\n4. Іноді в лабіринті може з'явитися динаміт, який завдає сильного ушкодження.\n5. Іноді в лабіринті з'являються торговці, які продають різні речі за зірочки та муви (муви - це валюта, що визначається кількістю разів як ви натиснули кнопку зі стрілочкою).\n6. Предмети поділяються на 4 типи: Мечі, Артефакти, Зілля та Пети (іноді пети багаються). Мечі просто збільшують завдане вами ушкодження Тіні. Артефакти надають різні ефекти. Зілля просто дають який-небудь бустер або бонус. Пети слідкують за Тінню та б'ють її (теоретично).\n7. Щоб переглянути активні зілля, натисніть кнопку BACKPACK у боті.\n8. Ваш пет за замовчуванням - Камінь. Він не рухається.\n9. Моя сестра дуже боялася музики в грі, тому я створив артефакт, який змінює музику.\n10. Інший світ. Якщо ви вдастесь втекти з лабіринту, вас телепортує в інший світ, де кожна зірочка дорівнює трьом, і динаміт завдає подвійного ушкодження.\n11. Динаміт завдає ушкодження навіть Тіні.\n12. Пети можуть зупинятися на 3 секунди.\n13. Здоров'я Тіні відображається над нею. Якщо ви її поб'єте, вона відродиться і стане вдвічі потужнішою. Ваша мета - довести Тінь до 5 воскресінь.\n14. Тінь дуже міцна! Щоб атакувати її, натискайте кнопку Attack у боті. Без мечів ви завдаєте лише 1 пошкодження за ударом.\n\nДякую вам за увагу, тепер ви готові до битви! Мій GitHub - https://github.com/vaniademianov. Є питання? Звертайтеся до мене в Microsoft Teams. Тепер запустіть emergency.bat і покажіть, хто тут справжня Легенда Лабіринтів!"
}